spec/fixtures/requests/validate_tin.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <ValidateTinName xmlns="http://www.TinCheck.com/WebServices/PVSService/">
      <TinName>
        <TIN>000000000</TIN>
        <LName>John Smith</LName>
      </TinName>
      <CurUser>
        <UserLogin>user@example.com</UserLogin>
        <UserPassword>example-password</UserPassword>
      </CurUser>
    </ValidateTinName>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
